/*:
 [Previous](@previous)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;[Next](@next)
 
 # Model-view-controller (MVC)
 - - - - - - - - - -
 ![MVC Diagram](MVC_Diagram.png)
 
 Паттерн модель-представление-контроллер (MVC) разделяет объекты на три типа: модели, представления и контроллеры.
 
 **Models** хранят данные приложения. Обычно это структуры или простые классы.
 
 **Views** отображают визуальные элементы и элементы управления на экране. Обычно они являются подклассами `UIView`.
 
 **Controllers** координация между моделями и представлениями. Обычно они являются подклассами `UIViewController`.
 
 ## Code Example
 */
